## Pandas  data  frames

In [1]:
import pandas as pd

In [2]:
frame=pd.DataFrame({'number':range(10),'chars':['a']*10})

In [3]:
frame.head()

  chars  number
0     a       0
1     a       1
2     a       2
3     a       3
4     a       4

In [10]:
frame=pd.read_csv('dataset.tsv',header=0,sep='\t')

In [11]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [12]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [21]:
new_line={'Name':'Beyhan','Birth':'11.01.1900','City':'DisnayLand'}

In [22]:
frame=frame.append(new_line,ignore_index=True)#is  puts  nan   cause column   Position not passed

In [26]:
frame['tralala']=[False]*5+[True]*3

In [28]:
frame

              Name       Birth        City  Position tralala
0      Иванов А.А.  22.03.1980      Москва       NaN   False
1     Сорокин И.В.  07.08.1965   Волгоград   инженер   False
2       Белов М.М.  13.02.1980      Ростов  менеджер   False
3  Мельникова Д.С.  15.04.1985      Ростов       NaN   False
4      Рыбина Е.П.  19.11.1985      Москва   инженер   False
5     Костров С.О.  31.05.1985      Москва    стажер    True
6            Beyhn  11.01.1900  DisnayLand       NaN    True
7           Beyhan  11.01.1900  DisnayLand       NaN    True

In [29]:
frame.drop([1,2],axis=0)

              Name       Birth        City Position tralala
0      Иванов А.А.  22.03.1980      Москва      NaN   False
3  Мельникова Д.С.  15.04.1985      Ростов      NaN   False
4      Рыбина Е.П.  19.11.1985      Москва  инженер   False
5     Костров С.О.  31.05.1985      Москва   стажер    True
6            Beyhn  11.01.1900  DisnayLand      NaN    True
7           Beyhan  11.01.1900  DisnayLand      NaN    True

In [31]:
frame.drop(['City'],axis=1)

              Name       Birth  Position tralala
0      Иванов А.А.  22.03.1980       NaN   False
1     Сорокин И.В.  07.08.1965   инженер   False
2       Белов М.М.  13.02.1980  менеджер   False
3  Мельникова Д.С.  15.04.1985       NaN   False
4      Рыбина Е.П.  19.11.1985   инженер   False
5     Костров С.О.  31.05.1985    стажер    True
6            Beyhn  11.01.1900       NaN    True
7           Beyhan  11.01.1900       NaN    True

In [34]:
frame.to_csv('Updated_frame.csv',header=True,index=None)

In [35]:
!cat Updated_frame.csv

Name,Birth,City,Position,tralala
Иванов А.А.,22.03.1980,Москва,,False
Сорокин И.В.,07.08.1965,Волгоград,инженер,False
Белов М.М.,13.02.1980,Ростов,менеджер,False
Мельникова Д.С.,15.04.1985,Ростов,,False
Рыбина Е.П.,19.11.1985,Москва,инженер,False
Костров С.О.,31.05.1985,Москва,стажер,True
Beyhn,11.01.1900,DisnayLand,,True
Beyhan,11.01.1900,DisnayLand,,True

In [36]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
tralala       bool
dtype: object

In [48]:
frame.Birth=frame.Birth.apply(pd.to_datetime)

In [49]:
frame

              Name      Birth        City  Position tralala
0      Иванов А.А. 1980-03-22      Москва       NaN   False
1     Сорокин И.В. 1965-07-08   Волгоград   инженер   False
2       Белов М.М. 1980-02-13      Ростов  менеджер   False
3  Мельникова Д.С. 1985-04-15      Ростов       NaN   False
4      Рыбина Е.П. 1985-11-19      Москва   инженер   False
5     Костров С.О. 1985-05-31      Москва    стажер    True
6            Beyhn 1900-11-01  DisnayLand       NaN    True
7           Beyhan 1900-11-01  DisnayLand       NaN    True

In [50]:
 frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
tralala               bool
dtype: object

In [51]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
Name        8 non-null object
Birth       8 non-null datetime64[ns]
City        8 non-null object
Position    4 non-null object
tralala     8 non-null bool
dtypes: bool(1), datetime64[ns](1), object(3)
memory usage: 344.0+ bytes

In [54]:
frame.fillna('-2000',inplace=True)

In [55]:
frame

              Name      Birth        City  Position tralala
0      Иванов А.А. 1980-03-22      Москва     -2000   False
1     Сорокин И.В. 1965-07-08   Волгоград   инженер   False
2       Белов М.М. 1980-02-13      Ростов  менеджер   False
3  Мельникова Д.С. 1985-04-15      Ростов     -2000   False
4      Рыбина Е.П. 1985-11-19      Москва   инженер   False
5     Костров С.О. 1985-05-31      Москва    стажер    True
6            Beyhn 1900-11-01  DisnayLand     -2000    True
7           Beyhan 1900-11-01  DisnayLand     -2000    True

In [56]:
frame[['Name','Position']]

              Name  Position
0      Иванов А.А.     -2000
1     Сорокин И.В.   инженер
2       Белов М.М.  менеджер
3  Мельникова Д.С.     -2000
4      Рыбина Е.П.   инженер
5     Костров С.О.    стажер
6            Beyhn     -2000
7           Beyhan     -2000

In [57]:
frame.head(3)

           Name      Birth       City  Position tralala
0   Иванов А.А. 1980-03-22     Москва     -2000   False
1  Сорокин И.В. 1965-07-08  Волгоград   инженер   False
2    Белов М.М. 1980-02-13     Ростов  менеджер   False

In [61]:
frame[-3:]

           Name      Birth        City Position tralala
5  Костров С.О. 1985-05-31      Москва   стажер    True
6         Beyhn 1900-11-01  DisnayLand    -2000    True
7        Beyhan 1900-11-01  DisnayLand    -2000    True

In [72]:
s=frame.loc[[1,3,5],['Name','Position']]
s

              Name Position
1     Сорокин И.В.  инженер
3  Мельникова Д.С.    -2000
5     Костров С.О.   стажер

In [73]:
type(s)

pandas.core.frame.DataFrame

In [75]:
s=frame.iloc[[1,3,4],[1,2]]
s

       Birth       City
1 1965-07-08  Волгоград
3 1985-04-15     Ростов
4 1985-11-19     Москва

In [76]:
type(s)

pandas.core.frame.DataFrame

In [77]:
s=frame.ix[[1,3,5],[0,2]]
s

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [78]:
type(s)

pandas.core.frame.DataFrame

# SUbseting

In [81]:
frame[frame.Birth>=pd.datetime(1986,5,13)]

Empty DataFrame
Columns: [Name, Birth, City, Position, tralala]
Index: []

In [82]:
frame[frame.Birth>=pd.datetime(1950,5,13)]

              Name      Birth       City  Position tralala
0      Иванов А.А. 1980-03-22     Москва     -2000   False
1     Сорокин И.В. 1965-07-08  Волгоград   инженер   False
2       Белов М.М. 1980-02-13     Ростов  менеджер   False
3  Мельникова Д.С. 1985-04-15     Ростов     -2000   False
4      Рыбина Е.П. 1985-11-19     Москва   инженер   False
5     Костров С.О. 1985-05-31     Москва    стажер    True

In [84]:
frame[(frame.Birth>=pd.datetime(1960,5,13)) & (frame.City=='Москва')]

           Name      Birth    City Position tralala
0   Иванов А.А. 1980-03-22  Москва    -2000   False
4   Рыбина Е.П. 1985-11-19  Москва  инженер   False
5  Костров С.О. 1985-05-31  Москва   стажер    True